```
CBS apply & update &destroy with prepaid instance
terraform apply
2020/05/15 15:08:38 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_cbs_storage.storage_upgrade will be created
  + resource "tencentcloud_cbs_storage" "storage_upgrade" {
      + attached           = (known after apply)
      + availability_zone  = "ap-guangzhou-3"
      + charge_type        = "POSTPAID_BY_HOUR"
      + force_delete       = false
      + id                 = (known after apply)
      + prepaid_period     = (known after apply)
      + prepaid_renew_flag = (known after apply)
      + project_id         = 0
      + snapshot_id        = (known after apply)
      + storage_name       = "tf-storage-upgrade"
      + storage_size       = 50
      + storage_status     = (known after apply)
      + storage_type       = "CLOUD_PREMIUM"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

tencentcloud_cbs_storage.storage_upgrade: Creating...
tencentcloud_cbs_storage.storage_upgrade: Creation complete after 1s [id=disk-g2wgtrdw]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

 terraform apply
2020/05/15 15:09:53 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
tencentcloud_cbs_storage.storage_upgrade: Refreshing state... [id=disk-g2wgtrdw]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # tencentcloud_cbs_storage.storage_upgrade will be updated in-place
  ~ resource "tencentcloud_cbs_storage" "storage_upgrade" {
        attached           = false
        availability_zone  = "ap-guangzhou-3"
      ~ charge_type        = "POSTPAID_BY_HOUR" -> "PREPAID"
        encrypt            = false
      ~ force_delete       = false -> true
        id                 = "disk-g2wgtrdw"
      + prepaid_period     = 1
      + prepaid_renew_flag = "NOTIFY_AND_MANUAL_RENEW"
        project_id         = 0
        storage_name       = "tf-storage-upgrade"
        storage_size       = 50
        storage_status     = "UNATTACHED"
        storage_type       = "CLOUD_PREMIUM"
        tags               = {}
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

tencentcloud_cbs_storage.storage_upgrade: Modifying... [id=disk-g2wgtrdw]
tencentcloud_cbs_storage.storage_upgrade: Modifications complete after 1s [id=disk-g2wgtrdw]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.

terraform destroy
2020/05/15 15:10:44 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
tencentcloud_cbs_storage.storage_upgrade: Refreshing state... [id=disk-g2wgtrdw]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # tencentcloud_cbs_storage.storage_upgrade will be destroyed
  - resource "tencentcloud_cbs_storage" "storage_upgrade" {
      - attached           = false -> null
      - availability_zone  = "ap-guangzhou-3" -> null
      - charge_type        = "PREPAID" -> null
      - encrypt            = false -> null
      - force_delete       = true -> null
      - id                 = "disk-g2wgtrdw" -> null
      - prepaid_period     = 1 -> null
      - prepaid_renew_flag = "NOTIFY_AND_MANUAL_RENEW" -> null
      - project_id         = 0 -> null
      - storage_name       = "tf-storage-upgrade" -> null
      - storage_size       = 50 -> null
      - storage_status     = "UNATTACHED" -> null
      - storage_type       = "CLOUD_PREMIUM" -> null
      - tags               = {} -> null
    }

Plan: 0 to add, 0 to change, 1 to destroy.

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

tencentcloud_cbs_storage.storage_upgrade: Destroying... [id=disk-g2wgtrdw]
tencentcloud_cbs_storage.storage_upgrade: Destruction complete after 3s

Destroy complete! Resources: 1 destroyed.

```